[Killed] ArrowFunction
src/utils/sheduleUtils.js:3:27
 import {isEmpty} from 'lodash';
 
-const getScheduleByType = (entityId, semesterId) => ({});
+const getScheduleByType = () => undefined;
 
 const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
killedBy: getScheduleByType should return an empty object for any entity and semester id
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/utils/sheduleUtils.js:5:72
 
 const getScheduleByType = (entityId, semesterId) => ({});
 
-const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
+const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && loading;
 
 const filterClassesArray = (inputArray) => {
killedBy: isNotReadySchedule when schedule is empty ({}) should return true when loading is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/sheduleUtils.js:5:51
 
 const getScheduleByType = (entityId, semesterId) => ({});
 
-const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
+const isNotReadySchedule = (schedule, loading) => true;
 
 const filterClassesArray = (inputArray) => {
killedBy: isNotReadySchedule when schedule is empty ({}) should return false when loading is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/sheduleUtils.js:7:44
 
 const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
 
-const filterClassesArray = (inputArray) => {
-    return inputArray.filter((item, index, array) => {
-        const resIndex = array.findIndex((findItem) => findItem.id === item.id);
-        return resIndex === index;
-    });
-};
+const filterClassesArray = (inputArray) => {};
 
 export { getScheduleByType, isNotReadySchedule, filterClassesArray };
killedBy: filterClassesArray should return empty array for empty input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/utils/sheduleUtils.js:8:54
 const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
 
 const filterClassesArray = (inputArray) => {
-    return inputArray.filter((item, index, array) => {
-        const resIndex = array.findIndex((findItem) => findItem.id === item.id);
-        return resIndex === index;
-    });
+    return inputArray.filter((item, index, array) => {});
 };
 
killedBy: filterClassesArray should return all elements when all ids are unique
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "id": 1,

[Killed] MethodExpression
src/utils/sheduleUtils.js:8:12
 const isNotReadySchedule = (schedule, loading) => isEmpty(schedule) && !loading;
 
 const filterClassesArray = (inputArray) => {
-    return inputArray.filter((item, index, array) => {
-        const resIndex = array.findIndex((findItem) => findItem.id === item.id);
-        return resIndex === index;
-    });
+    return inputArray;
 };
 
killedBy: filterClassesArray should remove duplicate entries keeping first occurrence
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"id": 1, "name": "Math"}, {"id": 2, "name": "Physics"}, {"id": 1, "name": "Math duplicate"}]

[Killed] ConditionalExpression
src/utils/sheduleUtils.js:9:56
 
 const filterClassesArray = (inputArray) => {
     return inputArray.filter((item, index, array) => {
-        const resIndex = array.findIndex((findItem) => findItem.id === item.id);
+        const resIndex = array.findIndex((findItem) => true);
         return resIndex === index;
     });
killedBy: filterClassesArray should return all elements when all ids are unique
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 0

  Array [
    Object {
      "id": 1,

[Killed] EqualityOperator
src/utils/sheduleUtils.js:9:56
 
 const filterClassesArray = (inputArray) => {
     return inputArray.filter((item, index, array) => {
-        const resIndex = array.findIndex((findItem) => findItem.id === item.id);
+        const resIndex = array.findIndex((findItem) => findItem.id !== item.id);
         return resIndex === index;
     });
killedBy: filterClassesArray should return all elements when all ids are unique
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "id": 1,

[Killed] ConditionalExpression
src/utils/sheduleUtils.js:10:16
 const filterClassesArray = (inputArray) => {
     return inputArray.filter((item, index, array) => {
         const resIndex = array.findIndex((findItem) => findItem.id === item.id);
-        return resIndex === index;
+        return true;
     });
 };
killedBy: filterClassesArray should remove duplicate entries keeping first occurrence
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [{"id": 1, "name": "Math"}, {"id": 2, "name": "Physics"}, {"id": 1, "name": "Math duplicate"}]

[Killed] EqualityOperator
src/utils/sheduleUtils.js:10:16
 const filterClassesArray = (inputArray) => {
     return inputArray.filter((item, index, array) => {
         const resIndex = array.findIndex((findItem) => findItem.id === item.id);
-        return resIndex === index;
+        return resIndex !== index;
     });
 };
killedBy: filterClassesArray should return all elements when all ids are unique
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "id": 1,
