[Killed] ArrowFunction
src/helper/getHref.js:5:24
 import {COMMON_LINK_TO_MEETING_WORD} from '../constants/translationLabels/common';
 import i18n from '../i18n';
 
-export const getHref = (link) => (
-    <a title={link} className="link-to-meeting" href={link} target="_blank" rel="noreferrer">
-        {i18n.t(COMMON_LINK_TO_MEETING_WORD)}
-    </a>
-);
+export const getHref = () => undefined;
 
killedBy: getHref function should return link with href
statusReason: Error: Unable to find an element with the title: https://www.youtube.com/.

<body>
  <div />
</body>
